app/controllers/lists_controller.rb

SELECT * FROM "lists"
---
  def index
    @lists = List.all

SELECT * FROM "lists" WHERE ("lists"."id" = 1)
---
  def show
    @list = List.find(params[:id])

SELECT * FROM "lists" WHERE ("lists"."id" = 2)
---
  def edit
    @list = List.find(params[:id])

INSERT INTO "lists" ("updated_at", "title", "description", "created_at") VALUES('2010-02-11 03:07:24', 'Grocery', 'gotta buy this stuff', '2010-02-11 03:07:24')
---
  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save

SELECT * FROM "lists" WHERE ("lists"."id" = 2)
UPDATE "lists" SET "title" = 'Errands', "description" = 'borinngg', "updated_at" = '2010-02-11 03:08:04' WHERE "id" = 2
---
  def update
    @list = List.find(params[:id])

    respond_to do |format|
      if @list.update_attributes(params[:list])