app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("completed", "updated_at", "title", "list_id", "created_at") VALUES('f', '2010-02-11 03:30:44', 'rrr', NULL, '2010-02-11 03:30:44')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "completed" = 't', "updated_at" = '2010-02-04 02:56:15' WHERE "id" = 1